In [2]:
import numpy as np
import pandas as pd

In [3]:
# we are probably thinkin that data is clean 
# its good that it is already collected
train = pd.read_csv('datasets/titanic/train.csv')
test = pd.read_csv('datasets/titanic/test.csv')

In [4]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
# NA test before modeling
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
test.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [9]:
median_age_train = train.Age.median()
train['Age'] = train['Age'].fillna(median_age_train)
test['Age'] = test['Age'].fillna(median_age_train)
"""странно что в примере тестовым данным тоже присваивается среднее по обучающим
в моем понимании модель можт принять признак отсутвия возраста, т.е среденне значение за нейкий критерий, 
для чистоты эксперемента нужно симметировать ситуацию без толбца АГЕ и без данных не имеющих столбца АГЕ"""

'странно что в примере тестовым данным тоже присваивается среднее по обучающим\nв моем понимании модель можт принять признак отсутвия возраста, т.е среденне значение за нейкий критерий, \nдля чистоты эксперемента нужно симметировать ситуацию без толбца АГЕ и без данных не имеющих столбца АГЕ'

In [10]:
train['IsFemale'] = (train['Sex'] == 'female').astype(int)
test['IsFemale'] = (test['Sex'] == 'female').astype(int)

In [20]:
train.Sex.value_counts() # TEST

male      577
female    314
Name: Sex, dtype: int64

In [21]:
predictors = ['Pclass', 'IsFemale', 'Age']
X_train = train[predictors].values
X_test = test[predictors].values
y_train = train['Survived'].values

In [26]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression()
res = model.fit(X_train,y_train)

In [32]:
len(X_train)

891

In [33]:
model?

In [35]:
y_predict = model.predict(X_test)
y_predict[:10]

array([0, 0, 0, 0, 1, 0, 1, 0, 1, 0], dtype=int64)

In [37]:
# (y_true == y_predict).mean() if true data is available

In [39]:
from sklearn.model_selection import cross_val_score
model = LogisticRegression(C=10)
scores = cross_val_score(model, X_train, y_train, cv=4)
scores # crossing control test

array([0.77578475, 0.79820628, 0.77578475, 0.78828829])